# Pair Programming Limpieza I

Hipótesis

- La edad, el trabajo, el estado civil, la educación, la situación de deuda y la forma de contacto pueden influir en la probabilidad de que un cliente acepte la oferta.

- El número de veces que se ha contactado a un cliente en el pasado (campo campaign), el número de días que han pasado desde el último contacto (campo pdays), y el resultado de la campaña anterior (campo poutcome) pueden afectar la respuesta del cliente a una nueva oferta.

- Las variables económicas (tales como el índice de precios al consumidor (cons.price.idx), la tasa de variación del empleo (emp.var.rate), etc.) pueden influir en la probabilidad de que un cliente acepte la oferta.

- Los clientes que ya tienen una hipoteca (housing) o un préstamo (loan) pueden ser menos propensos a aceptar una nueva oferta, ya que podrían estar limitados financieramente.

In [1]:
import pandas as pd
import numpy as np

from scipy import stats 
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data

In [2]:
df = pd.read_csv("datos/bank-additional-full.csv", index_col=0)

In [3]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"


Entre las tareas que tendréis que hacer hoy:

1. Explora el dataset con los métodos que hemos ido aprendiendo hasta ahora para familiarizarnos con los datos.

In [17]:
def exploracion(dataframe, nombre):
    print(f"El dataframe tiene {dataframe.shape[0]} filas y {dataframe.shape[1]} columnas")
    print('---------')

    print(f"El dataframe tiene las siguientes columnas:")

    for col in dataframe.columns:
        print(col) 
    print("--------------")

    print(f"Los principales estadísticos de las variables numéricas son:")
    display(dataframe.describe().T)
    print("--------------")

    print(f"Los principales estadísticos de las variables categóricas son:")
    display(dataframe.describe(include=object).T)
    print("--------------")

    print("El numero de valores distintos de cada columna es:")
    for col in dataframe.columns:
            print(col, len(dataframe[col].value_counts()))

    print(f"Los valores únicos del dataframe son: {dataframe.unique()}")
    print("--------------")

    print(f"Hay {dataframe.duplicated().sum()} filas duplicadas.")
    print("--------------")  

    print("A continuación el resultado del método .info():")
    dataframe.info()

In [19]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

In [21]:
# para ver todas las columnas

pd.options.display.max_columns = None

In [22]:
print(f"El dataframe tiene {df.shape[0]} filas y {df.shape[1]} columnas")

El dataframe tiene 43170 filas y 20 columnas

In [24]:
# for loop para sacar las columnas

for col in df.columns:
        print(col)

age
job
marital
education
default
housing
loan
contact
duration
campaign
pdays
previous
poutcome
emp.var.rate
cons.price.idx
cons.conf.idx
euribor3m
nr.employed
y
month_day_week

In [26]:
# otro método

df.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'month_day_week'],
      dtype='object')

In [27]:
print(f"Los principales estadísticos de las variables numéricas son:")
display(df.describe().T)
print("--------------")


print(f"Los principales estadísticos de las variables categóricas son:")
display(df.describe(include=object).T)
print("--------------")

Los principales estadísticos de las variables numéricas son:

,count,mean,std,min,25%,50%,75%,max
age,43170.0,40.014918,10.407327,17.0,32.0,38.0,47.0,98.0
default,34154.0,0.000088,0.009372,0.0,0.0,0.0,0.0,1.0
housing,42139.0,0.535869,0.498718,0.0,0.0,1.0,1.0,1.0
loan,42139.0,0.155652,0.362529,0.0,0.0,0.0,0.0,1.0
duration,43170.0,257.883739,259.393738,0.0,102.0,179.0,319.0,4918.0
campaign,43170.0,2.564675,2.768538,1.0,1.0,2.0,3.0,56.0
pdays,43170.0,962.452282,186.962379,0.0,999.0,999.0,999.0,999.0
previous,43170.0,0.173639,0.496750,0.0,0.0,0.0,0.0,7.0
emp.var.rate,43170.0,0.078177,1.572217,-3.4,-1.8,1.1,1.4,1.4

--------------
Los principales estadísticos de las variables categóricas son:

                count unique                top   freq
job             42823     11             admin.  10918
marital         43085      3            MARRIED  26105
education       41355      7  university.degree  12766
contact         43170      2           cellular  27438
poutcome        43170      3        NONEXISTENT  37261
cons.price.idx  43170     26             93,994   8117
cons.conf.idx   43170     26              -36,4   8117
euribor3m       43170    316              4,857   3002
nr.employed     43170     11             5228,1  16981
y               43170      2                 no  38308
month_day_week  43170     50     ['may', 'wed']   3039

--------------

In [28]:
col_cat = df.select_dtypes(include = "object")
col_cat.head()

,job,marital,education,contact,poutcome,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,month_day_week
0,housemaid,MARRIED,basic.4y,telephone,NONEXISTENT,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,services,MARRIED,high.school,telephone,NONEXISTENT,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
2,services,MARRIED,high.school,telephone,NONEXISTENT,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
3,admin.,MARRIED,basic.6y,telephone,NONEXISTENT,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
4,services,MARRIED,high.school,telephone,NONEXISTENT,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

In [29]:
# para los valores únicos de todas las columnas

for col in col_cat.columns:
    print("----------------------------------------------------", "\n")
    print(f"En la columna {col} tenemos los siguientes valores unicos")
    print(df[col].unique())
    print("\n", "----------------------------------------------", "\n")

----------------------------------------------------

En la columna job tenemos los siguientes valores unicos
['housemaid' 'services' 'admin.' 'blue-collar' 'technician' 'retired'
 'management' 'unemployed' 'self-employed' nan 'entrepreneur' 'student']

 ----------------------------------------------

----------------------------------------------------

En la columna marital tenemos los siguientes valores unicos
['MARRIED' 'SINGLE' 'DIVORCED' nan]

 ----------------------------------------------

----------------------------------------------------

En la columna education tenemos los siguientes valores unicos
['basic.4y' 'high.school' 'basic.6y' 'basic.9y' 'professional.course' nan
 'university.degree' 'illiterate']

 ----------------------------------------------

----------------------------------------------------

En la columna contact tenemos los siguientes valores unicos
['telephone' 'cellular']

 ----------------------------------------------

----------------------------------------------------

En la columna poutcome tenemos los siguientes valores unicos
['NONEXISTENT' 'FAILURE' 'SUCCESS']

 ----------------------------------------------

----------------------------------------------------

En la columna cons.price.idx tenemos los siguientes valores unicos
['93,994' '94,465' '93,918' '93,444' '93,798' '93,2' '92,756' '92,843'
 '93,075' '92,893' '92,963' '92,469' '92,201' '92,379' '92,431' '92,649'
 '92,713' '93,369' '93,749' '93,876' '94,055' '94,215' '94,027' '94,199'
 '94,601' '94,767']

 ----------------------------------------------

----------------------------------------------------

En la columna cons.conf.idx tenemos los siguientes valores unicos
['-36,4' '-41,8' '-42,7' '-36,1' '-40,4' '-42,0' '-45,9' '-50,0' '-47,1'
 '-46,2' '-40,8' '-33,6' '-31,4' '-29,8' '-26,9' '-30,1' '-33,0' '-34,8'
 '-34,6' '-40,0' '-39,8' '-40,3' '-38,3' '-37,5' '-49,5' '-50,8']

 ----------------------------------------------

----------------------------------------------------

En la columna euribor3m tenemos los siguientes valores unicos
['4,857' '4,856' '4,855' '4,859' '4,86' '4,858' '4,864' '4,865' '4,866'
 '4,967' '4,961' '4,959' '4,958' '4,96' '4,962' '4,955' '4,947' '4,956'
 '4,966' '4,963' '4,957' '4,968' '4,97' '4,965' '4,964' '5,045' '5,0'
 '4,936' '4,921' '4,918' '4,912' '4,827' '4,794' '4,76' '4,733' '4,7'
 '4,663' '4,592' '4,474' '4,406' '4,343' '4,286' '4,245' '4,223' '4,191'
 '4,153' '4,12' '4,076' '4,021' '3,901' '3,879' '3,853' '3,816' '3,743'
 '3,669' '3,563' '3,488' '3,428' '3,329' '3,282' '3,053' '1,811' '1,799'
 '1,778' '1,757' '1,726' '1,703' '1,687' '1,663' '1,65' '1,64' '1,629'
 '1,614' '1,602' '1,584' '1,574' '1,56' '1,556' '1,548' '1,538' '1,531'
 '1,52' '1,51' '1,498' '1,483' '1,479' '1,466' '1,453' '1,445' '1,435'
 '1,423' '1,415' '1,41' '1,405' '1,406' '1,4' '1,392' '1,384' '1,372'
 '1,365' '1,354' '1,344' '1,334' '1,327' '1,313' '1,299' '1,291' '1,281'
 '1,266' '1,25' '1,244' '1,259' '1,264' '1,27' '1,262' '1,26' '1,268'
 '1,286' '1,252' '1,235' '1,224' '1,215' '1,206' '1,099' '1,085' '1,072'
 '1,059' '1,048' '1,044' '1,029' '1,018' '1,007' '0,996' '0,979' '0,969'
 '0,944' '0,937' '0,933' '0,927' '0,921' '0,914' '0,908' '0,903' '0,899'
 '0,884' '0,883' '0,881' '0,879' '0,873' '0,869' '0,861' '0,859' '0,854'
 '0,851' '0,849' '0,843' '0,838' '0,834' '0,829' '0,825' '0,821' '0,819'
 '0,813' '0,809' '0,803' '0,797' '0,788' '0,781' '0,778' '0,773' '0,771'
 '0,77' '0,768' '0,766' '0,762' '0,755' '0,749' '0,743' '0,741' '0,739'
 '0,75' '0,753' '0,754' '0,752' '0,744' '0,74' '0,742' '0,737' '0,735'
 '0,733' '0,73' '0,731' '0,728' '0,724' '0,722' '0,72' '0,719' '0,716'
 '0,715' '0,714' '0,718' '0,721' '0,717' '0,712' '0,71' '0,709' '0,708'
 '0,706' '0,707' '0,7' '0,655' '0,654' '0,653' '0,652' '0,651' '0,65'
 '0,649' '0,646' '0,644' '0,643' '0,639' '0,637' '0,635' '0,636' '0,634'
 '0,638' '0,64' '0,642' '0,645' '0,659' '0,663' '0,668' '0,672' '0,677'
 '0,682' '0,683' '0,684' '0,685' '0,688' '0,69' '0,692' '0,695' '0,697'
 '0,699' '0,701' '0,702' '0,704' '0,711' '0,713' '0,723' '0,727' '0,729'
 '0,732' '0,748' '0,761' '0,767' '0,782' '0,79' '0,793' '0,802' '0,81'
 '0,822' '0,827' '0,835' '0,84' '0,846' '0,87' '0,876' '0,885' '0,889'
 '0,893' '0,896' '0,898' '0,9' '0,904' '0,905' '0,895' '0,894' '0,891'
 '0,89' '0,888' '0,886' '0,882' '0,88' '0,878' '0,877' '0,942' '0,953'
 '0,956' '0,959' '0,965' '0,972' '0,977' '0,982' '0,985' '0,987' '0,993'
 '1,0' '1,008' '1,016' '1,025' '1,032' '1,037' '1,043' '1,045' '1,047'
 '1,05' '1,049' '1,046' '1,041' '1,04' '1,039' '1,035' '1,03' '1,031'
 '1,028']

 ----------------------------------------------

----------------------------------------------------

En la columna nr.employed tenemos los siguientes valores unicos
['5191,0' '5228,1' '5195,8' '5176,3' '5099,1' '5076,2' '5017,5' '5023,5'
 '5008,7' '4991,6' '4963,6']

 ----------------------------------------------

----------------------------------------------------

En la columna y tenemos los siguientes valores unicos
['no' 'yes']

 ----------------------------------------------

----------------------------------------------------

En la columna month_day_week tenemos los siguientes valores unicos
["['may', 'mon']" "['may', 'tue']" "['may', 'wed']" "['may', 'thu']"
 "['may', 'fri']" "['jun', 'mon']" "['jun', 'tue']" "['jun', 'wed']"
 "['jun', 'thu']" "['jun', 'fri']" "['jul', 'tue']" "['jul', 'wed']"
 "['jul', 'thu']" "['jul', 'fri']" "['jul', 'mon']" "['aug', 'mon']"
 "['aug', 'tue']" "['aug', 'wed']" "['aug', 'thu']" "['aug', 'fri']"
 "['oct', 'fri']" "['oct', 'mon']" "['oct', 'tue']" "['oct', 'wed']"
 "['oct', 'thu']" "['nov', 'mon']" "['nov', 'tue']" "['nov', 'wed']"
 "['nov', 'thu']" "['nov', 'fri']" "['dec', 'mon']" "['dec', 'wed']"
 "['dec', 'thu']" "['dec', 'fri']" "['dec', 'tue']" "['mar', 'mon']"
 "['mar', 'tue']" "['mar', 'wed']" "['mar', 'thu']" "['mar', 'fri']"
 "['apr', 'wed']" "['apr', 'thu']" "['apr', 'fri']" "['apr', 'mon']"
 "['apr', 'tue']" "['sep', 'tue']" "['sep', 'wed']" "['sep', 'thu']"
 "['sep', 'fri']" "['sep', 'mon']"]

 ----------------------------------------------

In [30]:
for col in col_cat.columns:
    print("----------------------------------------------------", "\n")
    print(f"En la columna {col} tenemos los siguientes valores unicos")
    print(pd.DataFrame(df[col].value_counts()))
    print("\n", "----------------------------------------------", "\n")

----------------------------------------------------

En la columna job tenemos los siguientes valores unicos
                 job
admin.         10918
blue-collar     9696
technician      7059
services        4173
management      3066
retired         1792
entrepreneur    1527
self-employed   1491
housemaid       1126
unemployed      1065
student          910

 ----------------------------------------------

----------------------------------------------------

En la columna marital tenemos los siguientes valores unicos
          marital
MARRIED     26105
SINGLE      12147
DIVORCED     4833

 ----------------------------------------------

----------------------------------------------------

En la columna education tenemos los siguientes valores unicos
                     education
university.degree        12766
high.school               9967
basic.9y                  6331
professional.course       5497
basic.4y                  4376
basic.6y                  2400
illiterate                  18

 ----------------------------------------------

----------------------------------------------------

En la columna contact tenemos los siguientes valores unicos
           contact
cellular     27438
telephone    15732

 ----------------------------------------------

----------------------------------------------------

En la columna poutcome tenemos los siguientes valores unicos
             poutcome
NONEXISTENT     37261
FAILURE          4472
SUCCESS          1437

 ----------------------------------------------

----------------------------------------------------

En la columna cons.price.idx tenemos los siguientes valores unicos
        cons.price.idx
93,994            8117
93,918            7005
92,893            6081
93,444            5408
94,465            4568
93,2              3804
93,075            2582
92,201             815
92,963             748
92,431             477
92,649             379
94,215             328
94,199             318
92,843             299
92,379             277
93,369             275
94,027             245
94,055             239
93,876             225
94,601             214
92,469             185
93,749             183
92,713             181
94,767             133
93,798              73
92,756              11

 ----------------------------------------------

----------------------------------------------------

En la columna cons.conf.idx tenemos los siguientes valores unicos
       cons.conf.idx
-36,4           8117
-42,7           7005
-46,2           6081
-36,1           5408
-41,8           4568
-42,0           3804
-47,1           2582
-31,4            815
-40,8            748
-26,9            477
-30,1            379
-40,3            328
-37,5            318
-50,0            299
-29,8            277
-34,8            275
-38,3            245
-39,8            239
-40,0            225
-49,5            214
-33,6            185
-34,6            183
-33,0            181
-50,8            133
-40,4             73
-45,9             11

 ----------------------------------------------

----------------------------------------------------

En la columna euribor3m tenemos los siguientes valores unicos
       euribor3m
4,857       3002
4,962       2735
4,963       2601
4,961       1992
4,856       1259
...          ...
3,743          1
3,816          1
3,901          1
0,996          1
3,853          1

[316 rows x 1 columns]

 ----------------------------------------------

----------------------------------------------------

En la columna nr.employed tenemos los siguientes valores unicos
        nr.employed
5228,1        16981
5099,1         8962
5191,0         8117
5195,8         3877
5076,2         1748
5017,5         1133
4991,6          812
5008,7          683
4963,6          665
5023,5          181
5176,3           11

 ----------------------------------------------

----------------------------------------------------

En la columna y tenemos los siguientes valores unicos
         y
no   38308
yes   4862

 ----------------------------------------------

----------------------------------------------------

En la columna month_day_week tenemos los siguientes valores unicos
                month_day_week
['may', 'wed']            3039
['may', 'fri']            3004
['may', 'tue']            2944
['may', 'mon']            2765
['may', 'thu']            2671
['jul', 'thu']            1743
['jul', 'tue']            1588
['jul', 'mon']            1584
['jul', 'wed']            1538
['aug', 'thu']            1404
['aug', 'tue']            1356
['jun', 'mon']            1302
['aug', 'wed']            1298
['aug', 'mon']            1288
['jun', 'fri']            1191
['aug', 'fri']            1122
['jul', 'fri']            1065
['jun', 'wed']            1029
['jun', 'tue']            1019
['jun', 'thu']            1014
['nov', 'thu']             957
['nov', 'wed']             901
['nov', 'tue']             863
['apr', 'thu']             808
['nov', 'mon']             803
['nov', 'fri']             792
['apr', 'mon']             739
['apr', 'fri']             640
['apr', 'wed']             313
['apr', 'tue']             265
['oct', 'thu']             172
['oct', 'tue']             161
['oct', 'fri']             151
['mar', 'mon']             149
['mar', 'tue']             146
['oct', 'wed']             143
['oct', 'mon']             137
['sep', 'wed']             131
['sep', 'thu']             127
['sep', 'tue']             125
['sep', 'fri']             119
['mar', 'thu']             104
['mar', 'fri']             100
['sep', 'mon']              93
['mar', 'wed']              75
['dec', 'mon']              58
['dec', 'thu']              49
['dec', 'wed']              35
['dec', 'tue']              25
['dec', 'fri']              25

 ----------------------------------------------

In [32]:
# información completa dataset

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 43170 entries, 0 to 29612
Data columns (total 20 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             43170 non-null  int64
 1   job             42823 non-null  object
 2   marital         43085 non-null  object
 3   education       41355 non-null  object
 4   default         34154 non-null  float64
 5   housing         42139 non-null  float64
 6   loan            42139 non-null  float64
 7   contact         43170 non-null  object
 8   duration        43170 non-null  int64
 9   campaign        43170 non-null  int64
 10  pdays           43170 non-null  int64
 11  previous        43170 non-null  int64
 12  poutcome        43170 non-null  object
 13  emp.var.rate    43170 non-null  float64
 14  cons.price.idx  43170 non-null  object
 15  cons.conf.idx   43170 non-null  object
 16  euribor3m       43170 non-null  object
 17  nr.employed     43170 non-null  object
 18  y               43170 non-null  object
 19  month_day_week  43170 non-null  object
dtypes: float64(4), int64(5), object(11)
memory usage: 6.9+ MB

Hay 1994 filas duplicadas.


2. Cambia el nombre de las columnas para que no tengan puntos en el nombre. En concreto, reemplazad los "." por comas.

In [34]:
nuevas_columnas = {col: col.replace (".", ",").lower() for col in df.columns}

In [35]:
df.rename(columns = nuevas_columnas, inplace = True)

In [36]:
df.head(2)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"


3. ¿Hay valores duplicados en nuestro dataframe? En caso de que los haya, eliminándlos.

In [33]:
print(f"Hay {df.duplicated().sum()} filas duplicadas.")

Hay 1994 filas duplicadas.

In [38]:
df.drop_duplicates(inplace = True)
df.head(5)

,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week
0,56,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
1,57,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
2,37,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
3,40,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"
4,56,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,999,0,NONEXISTENT,1.1,"93,994","-36,4","4,857","5191,0",no,"['may', 'mon']"

In [40]:
print(f"Hay {df.duplicated().sum()} filas duplicadas.")

Hay 0 filas duplicadas.


4. Como hemos visto, algunas columnas no tienen el tipo de datos que deberían. Cambiad el tipo de dato para las columnas de cons.price.idx, cons.conf.idx, euribor3m, nr.employed.

In [41]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default           float64
housing           float64
loan              float64
contact            object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp,var,rate      float64
cons,price,idx     object
cons,conf,idx      object
euribor3m          object
nr,employed        object
y                  object
month_day_week     object
dtype: object

In [48]:
# pero siguen siendo strings 

df[['cons,price,idx','cons,conf,idx','euribor3m', 'nr,employed']] = df[['cons,price,idx','cons,conf,idx','euribor3m', 'nr,employed']].replace(r',', ".", regex=True)

In [49]:
df = df.astype({'cons,price,idx': 'float64','cons,conf,idx': 'float64','euribor3m': 'float64', 'nr,employed': 'float64'}, copy=True, errors='raise')

In [51]:
df.dtypes

age                 int64
job                object
marital            object
education          object
default           float64
housing           float64
loan              float64
contact            object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp,var,rate      float64
cons,price,idx    float64
cons,conf,idx     float64
euribor3m         float64
nr,employed       float64
y                  object
month_day_week     object
dtype: object


5. En las columnas de marital y month, poner todos los valores en minúsculas.
💡 Pista Podréis usar una función o una lambda 💡

6. Para no olvidarnos de la visualización. A través de la visualización, podemos detectar errores, valores atípicos, valores faltantes y otros problemas comunes en los datos que de otra manera podrían ser difíciles de identificar. Para esto vamos a hacer una serie de gráficas que deberán ser incluidas en un subplot. Estas gráficas tienen que ser:

- Una gráfica donde podamos ver si el tipo de trabajo afecta a que un cliente acepte la oferta.
- Una gráfica donde podamos ver si el hecho de que un cliente tenga una hipoteca afecta a que acepte la oferta.
- Una gráfica donde podamos ver si el hecho de que un cliente tenga un prestamo afecta a que acepte la oferta.
- Una gráfica donde podamos ver si hay una relación entre el numero de días desde el último contacto afecta a que un cliente acepte la oferta
- Una gráfica donde podamos ver si hay relación entre el resultado de la campaña anterior y si el cliente afecta a que el cliente acepte la oferta.

Guardamos el csv para seguir trabajando en el siguiente ejercicio de pair de limpieza.